<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'يجب قبول حقل السمة.',
    'accepted_if' => 'يجب قبول حقل السمة عندما: الآخر هو: القيمة.',
    'active_url' => 'يجب أن يكون حقل السمة عنوان URL صالحًا.',
    'after' => 'يجب أن يكون حقل السمة تاريخًا بعد: التاريخ.',
    'after_or_equal' => 'يجب أن يكون حقل السمة تاريخًا بعد أو يساوي: التاريخ.',
    'alpha' => 'يجب أن يحتوي حقل السمة على أحرف فقط.',
    'alpha_dash' => 'يجب أن يحتوي حقل السمة على رسائل وأرقام وشرطات وشرطات سحرية فقط.',
    'alpha_num' => 'يجب أن يحتوي حقل السمة على أحرف وأرقام فقط.',
    'array' => 'يجب أن يكون حقل السمة صفيفًا.',
    'ascii' => 'يجب أن يحتوي حقل السمة على أحرف ورموز أبجدية واحدة فقط.',
    'before' => 'يجب أن يكون حقل السمة تاريخًا سابقًا: التاريخ.',
    'before_or_equal' => 'يجب أن يكون حقل السمة تاريخًا قبل أو يساوي: التاريخ.',
    'between' => [
        'array' => 'يجب أن يكون حقل السمة بين: min و: max العناصر.',
        'file' => 'يجب أن يكون حقل السمة بين: min و: كيلوبايت كحد أقصى.',
        'numeric' => 'يجب أن يكون حقل السمة بين: Min و: Max.',
        'string' => 'يجب أن يكون حقل السمة بين: min و: أقصى أحرف.',
    ],
    'boolean' => 'يجب أن يكون حقل السمة صحيحًا أو خطأ.',
    'can' => 'يحتوي حقل السمة: على قيمة غير مصرح بها.',
    'confirmed' => 'لا يتطابق تأكيد حقل السمة.',
    'current_password' => 'كلمة المرور غير صحيحة.',
    'date' => 'يجب أن يكون حقل السمة تاريخًا صالحًا.',
    'date_equals' => 'يجب أن يكون حقل السمة تاريخًا يساوي: التاريخ.',
    'date_format' => 'يجب أن يتطابق حقل السمة مع التنسيق: التنسيق.',
    'decimal' => 'يجب أن يكون لحقل السمة: أماكن عشرية عشرية.',
    'declined' => 'يجب رفض حقل السمة.',
    'declined_if' => 'يجب رفض: حقل السمة عندما: الآخر هو: القيمة.',
    'different' => ': حقل السمة و: الآخر يجب أن يكون مختلفًا.',
    'digits' => 'يجب أن يكون حقل السمة: أرقام الأرقام.',
    'digits_between' => 'يجب أن يكون حقل السمة بين: Min و: Max Digits.',
    'dimensions' => 'يحتوي: حقل السمة على أبعاد صورة غير صالحة.',
    'distinct' => 'حقل السمة: له قيمة مكررة.',
    'doesnt_end_with' => 'يجب ألا ينتهي حقل السمة بأحد ما يلي:: القيم.',
    'doesnt_start_with' => 'يجب ألا يبدأ حقل السمة بواحد مما يلي:: القيم.',
    'email' => 'يجب أن يكون حقل السمة عنوان بريد إلكتروني صالح.',
    'ends_with' => 'يجب أن ينتهي حقل السمة مع أحد ما يلي:: القيم.',
    'enum' => 'المحدد: السمة غير صالحة.',
    'exists' => 'المحدد: السمة غير صالحة.',
    'file' => 'يجب أن يكون حقل السمة ملفًا.',
    'filled' => 'يجب أن يكون لحقل السمة قيمة.',
    'gt' => [
        'array' => 'يجب أن يحتوي حقل السمة على أكثر من: عناصر القيمة.',
        'file' => 'يجب أن يكون حقل السمة أكبر من: قيمة كيلوغرامات.',
        'numeric' => 'يجب أن يكون حقل السمة أكبر من: القيمة.',
        'string' => 'يجب أن يكون حقل السمة أكبر من: أحرف القيمة.',
    ],
    'gte' => [
        'array' => 'يجب أن يكون لحقل السمة: عناصر القيمة أو أكثر.',
        'file' => 'يجب أن يكون حقل السمة أكبر من أو يساوي: قيمة كيلوغرامات.',
        'numeric' => 'يجب أن يكون حقل السمة أكبر من أو يساوي: القيمة.',
        'string' => 'يجب أن يكون حقل السمة أكبر من أو يساوي: أحرف القيمة.',
    ],
    'image' => 'يجب أن يكون حقل السمة صورة.',
    'in' => 'المحدد: السمة غير صالحة.',
    'in_array' => 'يجب أن يوجد حقل السمة في: آخر.',
    'integer' => 'يجب أن يكون حقل السمة عددًا صحيحًا.',
    'ip' => 'يجب أن يكون حقل السمة عنوان IP صالحًا.',
    'ipv4' => 'يجب أن يكون حقل السمة عنوان IPv4 صالح.',
    'ipv6' => 'يجب أن يكون حقل السمة عنوان IPv6 صالح.',
    'json' => 'يجب أن يكون حقل السمة عبارة عن سلسلة JSON صالحة.',
    'lowercase' => 'يجب أن يكون حقل السمة صغيرًا.',
    'lt' => [
        'array' => 'يجب أن يحتوي حقل السمة على أقل من: عناصر القيمة.',
        'file' => 'يجب أن يكون حقل السمة أقل من: قيمة كيلوبايت.',
        'numeric' => 'يجب أن يكون حقل السمة أقل من: القيمة.',
        'string' => 'يجب أن يكون حقل السمة أقل من: أحرف القيمة.',
    ],
    'lte' => [
        'array' => 'يجب ألا يحتوي حقل السمة على أكثر من: عناصر القيمة.',
        'file' => 'يجب أن يكون حقل السمة أقل من أو يساوي: قيمة كيلوايت.',
        'numeric' => 'يجب أن يكون حقل السمة أقل من أو يساوي: القيمة.',
        'string' => 'يجب أن يكون حقل السمة أقل من أو يساوي: أحرف القيمة.',
    ],
    'mac_address' => 'يجب أن يكون حقل السمة عنوان MAC صالح.',
    'max' => [
        'array' => 'يجب ألا يحتوي حقل السمة على أكثر من: Max Attems.',
        'file' => 'يجب ألا يكون حقل السمة أكبر من: كيلوبايت كحد أقصى.',
        'numeric' => 'يجب ألا يكون حقل السمة أكبر من: Max.',
        'string' => 'يجب ألا يكون حقل السمة أكبر من: أقصى أحرف.',
    ],
    'max_digits' => 'يجب ألا يحتوي حقل السمة على أكثر من: أقصى أرقام.',
    'mimes' => 'يجب أن يكون حقل السمة ملفًا من النوع :: قيم.',
    'mimetypes' => 'يجب أن يكون حقل السمة ملفًا من النوع :: قيم.',
    'min' => [
        'array' => 'يجب أن يكون حقل السمة: عناصر دقيقة على الأقل.',
        'file' => 'يجب أن يكون حقل السمة: على الأقل: Min Kilobytes.',
        'numeric' => 'يجب أن يكون حقل السمة على الأقل: دقيقة.',
        'string' => 'يجب أن يكون حقل السمة: على الأقل: أحرف دقيقة.',
    ],
    'min_digits' => 'يجب أن يكون حقل السمة: على الأقل: Min Sigits.',
    'missing' => 'يجب أن يكون حقل السمة مفقودًا.',
    'missing_if' => 'يجب أن يكون حقل السمة مفقودًا عندما: الآخر هو: القيمة.',
    'missing_unless' => 'يجب أن يكون حقل السمة مفقودًا ما لم يكن: آخر هو: القيمة.',
    'missing_with' => 'يجب أن يكون حقل السمة مفقودًا عند: القيم موجودة.',
    'missing_with_all' => 'يجب أن يكون حقل السمة مفقودًا عند: القيم موجودة.',
    'multiple_of' => 'يجب أن يكون حقل السمة مضاعفًا: القيمة.',
    'not_in' => 'المحدد: السمة غير صالحة.',
    'not_regex' => 'تنسيق حقل السمة غير صالح.',
    'numeric' => 'يجب أن يكون حقل السمة رقمًا.',
    'password' => [
        'letters' => 'يجب أن يحتوي حقل السمة على حرف واحد على الأقل.',
        'mixed' => 'يجب أن يحتوي حقل السمة: على أحرف كبيرة واحدة على الأقل وحرف واحد.',
        'numbers' => 'يجب أن يحتوي حقل السمة على رقم واحد على الأقل.',
        'symbols' => 'يجب أن يحتوي حقل السمة على رمز واحد على الأقل.',
        'uncompromised' => 'المعطى: ظهرت السمة في تسرب البيانات.الرجاء اختيار مجموعة مختلفة: السمة.',
    ],
    'present' => 'يجب أن يكون حقل السمة موجودًا.',
    'prohibited' => 'حقل السمة محظور.',
    'prohibited_if' => 'حقل السمة محظور عندما: الآخر هو: القيمة.',
    'prohibited_unless' => 'حقل: حقل السمة محظور ما لم: آخر هو في: القيم.',
    'prohibits' => 'حقل: حقل السمة: الآخر من الوجود.',
    'regex' => 'تنسيق حقل السمة غير صالح.',
    'required' => 'هذه القيمة ضرورية.',
    'required_array_keys' => 'يجب أن يحتوي حقل السمة على إدخالات:: القيم.',
    'required_if' => 'الحقل: حقل السمة مطلوب عندما: الآخر هو: القيمة.',
    'required_if_accepted' => 'الحقل: حقل السمة مطلوب عندما: يتم قبول الآخر.',
    'required_unless' => 'مطلوب حقل السمة ما لم يكن: الآخر في: القيم.',
    'required_with' => 'حقل السمة مطلوب عندما: القيم موجودة.',
    'required_with_all' => 'حقل السمة مطلوب عندما: القيم موجودة.',
    'required_without' => ': حقل السمة مطلوب عندما: القيم غير موجودة.',
    'required_without_all' => 'حقل السمة مطلوب عندما لا يوجد أي من: القيم موجودة.',
    'same' => 'يجب أن يتطابق حقل السمة: الآخر.',
    'size' => [
        'array' => 'يجب أن يحتوي حقل السمة على: عناصر الحجم.',
        'file' => 'يجب أن يكون حقل السمة: حجم كيلوبايت.',
        'numeric' => 'يجب أن يكون حقل السمة: الحجم.',
        'string' => 'يجب أن يكون حقل السمة: أحرف الحجم.',
    ],
    'starts_with' => 'يجب أن يبدأ حقل السمة بأحد ما يلي:: القيم.',
    'string' => 'يجب أن يكون حقل السمة سلسلة.',
    'timezone' => 'يجب أن يكون حقل السمة منطقة زمنية صالحة.',
    'unique' => 'هذه القيمة مأخوذ بالفعل.',
    'uploaded' => 'فشل: السمة في التحميل.',
    'uppercase' => 'يجب أن يكون حقل السمة كبيرًا.',
    'url' => 'يجب أن يكون حقل السمة عنوان URL صالحًا.',
    'ulid' => 'يجب أن يكون حقل السمة أولد صالح.',
    'uuid' => 'يجب أن يكون حقل السمة uuid صالحًا.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'رسالة مخصصة',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
